backend/controllers/CategoryController.php

    public function actionCreate()
    {
        $model = new Category();

        if ($model->load(Yii::$app->request->post())) {
            if($model->isRoot)
            {
                $model->saveNodeAsRoot();
---
INSERT INTO `category` (`name`) VALUES ('Product')

    protected function findModel($id)
    {
        if (($model = Category::findOne($id)) !== null) {
---
SELECT * FROM `category` WHERE `id`='2'